thanhtranhd/simple-flight-controller/simple-flight-controller/hal_msp432.c
/*===================================================================
 * Project: simple-flight-controller 
 *
 * Hardware settings and hardware related codes 
 * 
 * Copyright (c) 2010 Thanh H Tran (thanhthd@gmail.com)
 *
 * This file is part of simple-flight-controller project
 *
 * Simple-Flight-Controller is free software: 
 * you can redistribute it and /or modify 
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * Simple-Flight-Controller is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with simple-flight-controller.  If not, see <http://www.gnu.org/licenses/>.
 * 
 *===================================================================
*/
#ifdef TARGET_IS_MSP432P4XX

#include "driverlib.h"
#include "types.h"
#include "hal.h"
#include "cmd.h"
#include "captures.h"
#include "quad_main.h"
#include "mixer.h"
#include "utils.h"

#ifdef USE_CC2500
#include "wireless.h"
#endif

volatile UINT16 ms_100_timer=TICKS_PER_100_MS;
volatile UINT16 ms_10_timer = TICKS_PER_10_MS;
volatile UINT16 pwm_rate_ticks = PWM_UPDATE_FREQ;

volatile UINT16 sec_ticks = 0;
volatile UINT32 ms100_ticks = 0;

UINT16   adc_buffer[ADC_NUMBER_SAMPLES];


/* channel 0: roll, 1: pitch, 2: throttle, 3: rudder,
 * 4: gyro - just like a Futaba radio system */
#define  MAX_CAPTURES_HISTORY   25
int channel_captures[5][MAX_CAPTURES_HISTORY];


/* Timer_A PWM Configuration Parameter */
Timer_A_PWMConfig pwmConfig =
{
        TIMER_A_CLOCKSOURCE_SMCLK,
        TIMER_A_CLOCKSOURCE_DIVIDER_1,
        32000,
        TIMER_A_CAPTURECOMPARE_REGISTER_1,
        TIMER_A_OUTPUTMODE_RESET_SET,
        3200
};

/*------------------------------------------------------------------------------
* SPI
------------------------------------------------------------------------------*/
#ifndef USE_CC2500
void SPI_init(void)
{

}
#endif


/***********************************************************
  Function:

   The following function is responsible for starting XT1 in the
   MSP432 that is used to source the internal FLL that drives the
   MCLK and SMCLK.
*/
void startCrystalOscillator(void)
{
    /* Configuring pins for peripheral/crystal HFXT*/
    MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_PJ,
            GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);

    /* Configuring pins for peripheral/crystal LFXT*/
    MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_PJ,
            GPIO_PIN0 | GPIO_PIN1, GPIO_PRIMARY_MODULE_FUNCTION);
}

/***********************************************************
  Function:

   The following function is responsible for setting up the system
   clock at a specified frequency.
*/
void setSystemClock(uint32_t CPU_Frequency)
{
    /* Setting the external clock frequency. This API is optional, but will
     * come in handy if the user ever wants to use the getMCLK/getACLK/etc
     * functions
     */
    MAP_CS_setExternalClockSourceFrequency(32768, CPU_Frequency);

    /* Before we start we have to change VCORE to 1 to support the 48MHz frequency */
    MAP_PCM_setCoreVoltageLevel(PCM_AM_LDO_VCORE1);
    MAP_FlashCtl_setWaitState(FLASH_BANK0, 1);
    MAP_FlashCtl_setWaitState(FLASH_BANK1, 1);

    /* Starting HFXT and LFXT in non-bypass mode without a timeout. */
    MAP_CS_startHFXT(false);
    MAP_CS_startLFXT(false);

    /* Initializing the clock source as follows:
     *      MCLK = HFXT = 48MHz
     *      ACLK = LFXT = 32KHz
     *      HSMCLK = HFXT/4 = 12MHz
     *      SMCLK = HFXT/2 = 24MHz
     *      BCLK  = REFO = 32kHz
     */
    MAP_CS_initClockSignal(CS_MCLK, CS_HFXTCLK_SELECT, CS_CLOCK_DIVIDER_1);
    MAP_CS_initClockSignal(CS_ACLK, CS_LFXTCLK_SELECT, CS_CLOCK_DIVIDER_1);
    MAP_CS_initClockSignal(CS_HSMCLK, CS_HFXTCLK_SELECT, CS_CLOCK_DIVIDER_4);
    MAP_CS_initClockSignal(CS_SMCLK, CS_HFXTCLK_SELECT, CS_CLOCK_DIVIDER_2);
    MAP_CS_initClockSignal(CS_BCLK, CS_REFOCLK_SELECT, CS_CLOCK_DIVIDER_1);

    // Setting ACLK to REFO 128Khz
//  MAP_CS_setReferenceOscillatorFrequency(CS_REFO_128KHZ);
//  MAP_CS_initClockSignal(CS_ACLK, CS_REFOCLK_SELECT, CS_CLOCK_DIVIDER_1);
}


/*------------------------------------------------------------------------------
* configure hw pins
------------------------------------------------------------------------------*/
void configure_mcu_pins()
{
   P2OUT = 0;
   P1OUT = 0;
   MAP_GPIO_setAsOutputPin(LED_GPIO_PORT, RED_LED);
   MAP_GPIO_setAsOutputPin(LED_GPIO_PORT, BLUE_LED);
   MAP_GPIO_setAsOutputPin(LED_GPIO_PORT, GREEN_LED);
   MAP_GPIO_setAsOutputPin(LED1_GPIO_PORT, LED1_LED);

   on_red_led();
   off_red_led();

}

/*------------------------------------------------------------------------------
* UART
------------------------------------------------------------------------------*/
void UART_init()
{
    /* UART Configuration Parameter. These are the configuration parameters to
     * make the eUSCI A UART module to operate with a 115200 baud rate. These
     * values were calculated using the online calculator that TI provides
     * at:
     * http://processors.wiki.ti.com/index.php/USCI_UART_Baud_Rate_Gen_Mode_Selection
     */
    eUSCI_UART_Config uartConfig =
    {
            EUSCI_A_UART_CLOCKSOURCE_SMCLK, // SMCLK Clock Source
            208, // BRDIV = 2500
            0, // UCxBRF = 0
            2, // UCxBRS = 0
            EUSCI_A_UART_NO_PARITY, // No Parity
            EUSCI_A_UART_LSB_FIRST, // LSB First
            EUSCI_A_UART_ONE_STOP_BIT, // One stop bit
            EUSCI_A_UART_MODE, // UART mode
            EUSCI_A_UART_LOW_FREQUENCY_BAUDRATE_GENERATION // Low Frequency Mode
    };

    /* Selecting P1.2 and P1.3 in UART mode */
    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P1,
             GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);

