thanhtranhd/simple-flight-controller/simple-flight-controller/hal_msp432.c
    /* Configuring UART Module */
    MAP_UART_initModule(EUSCI_A0_BASE, &uartConfig);

    /* Enable UART module */
    MAP_UART_enableModule(EUSCI_A0_BASE);

    /* Enabling interrupts */
    MAP_UART_enableInterrupt(EUSCI_A0_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);
    MAP_Interrupt_enableInterrupt(INT_EUSCIA0);
}

/*------------------------------------------------------------------------------
* Timer TA3.0, TA3.1: capture for throttle / rudder (P10.4, P10.5)
* Timer TA3.2, TA3.3, TA3.4 : capture for gyro, roll, pitch channels respecctively (P8.2, P9.2, P9.3)
------------------------------------------------------------------------------*/
static void timer_capture_init()
{
    /* Timer_A Continuous Mode Configuration Parameter */
    const Timer_A_ContinuousModeConfig continuousModeConfig =
    {
            TIMER_A_CLOCKSOURCE_SMCLK,           // SMCLK Clock Source
            TIMER_A_CLOCKSOURCE_DIVIDER_24,      // SMCLK/24 = 1MHz
            TIMER_A_TAIE_INTERRUPT_DISABLE,      // Disable Timer ISR
            TIMER_A_SKIP_CLEAR                   // Skup Clear Counter
    };

    /* Timer_A Capture Mode Configuration Parameter */
    Timer_A_CaptureModeConfig captureModeConfig =
    {
            TIMER_A_CAPTURECOMPARE_REGISTER_3,        // CCCR 3
            TIMER_A_CAPTUREMODE_RISING_AND_FALLING_EDGE,   // both Edges
            TIMER_A_CAPTURE_INPUTSELECT_CCIxA,        // captureInputSelect - B doesn't work
            TIMER_A_CAPTURE_SYNCHRONOUS,              // Synchronized Capture
            TIMER_A_CAPTURECOMPARE_INTERRUPT_ENABLE,  // Enable interrupt
            TIMER_A_OUTPUTMODE_OUTBITVALUE            // Output bit value
    };

    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(RX_CAP_THR_PORT,
                                                   RX_CAP_THR_PIN,
                                                   GPIO_SECONDARY_MODULE_FUNCTION);

    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(RX_CAP_ROL_PORT,
                                                   RX_CAP_ROL_PIN,
                                                   GPIO_SECONDARY_MODULE_FUNCTION);

    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(RX_CAP_PIT_PORT,
                                                  RX_CAP_PIT_PIN,
                                                  GPIO_SECONDARY_MODULE_FUNCTION);

    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(RX_CAP_RUD_PORT,
                                                  RX_CAP_RUD_PIN,
                                                  GPIO_SECONDARY_MODULE_FUNCTION);

    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(RX_CAP_GYR_PORT,
                                                  RX_CAP_GYR_PIN,
                                                  GPIO_SECONDARY_MODULE_FUNCTION);

    /* Configuring Capture Mode */
    captureModeConfig.captureRegister = RX_CAP_THR_CCCR;
    MAP_Timer_A_initCapture(RX_CAP_THR_TMR, &captureModeConfig);

    /* roll channel capture */
    captureModeConfig.captureRegister = RX_CAP_ROL_CCCR;
    MAP_Timer_A_initCapture(RX_CAP_ROL_TMR, &captureModeConfig);

    /* pitch channel capture */
    captureModeConfig.captureRegister = RX_CAP_PIT_CCCR;
    MAP_Timer_A_initCapture(RX_CAP_PIT_TMR, &captureModeConfig);

    /* rudder channel capture */
    captureModeConfig.captureRegister = RX_CAP_RUD_CCCR;
    MAP_Timer_A_initCapture(RX_CAP_RUD_TMR, &captureModeConfig);

    /* gyro channel capture */
    captureModeConfig.captureRegister = RX_CAP_GYR_CCCR;
    MAP_Timer_A_initCapture(RX_CAP_GYR_TMR, &captureModeConfig);

    /* Configuring timer Continuous Mode  -
     * all capture channels are on Timer A3 so only configure Timer A3 */
    MAP_Timer_A_configureContinuousMode(RX_CAP_ROL_TMR, &continuousModeConfig);

    /* Starting the Timer_A3 in continuous mode */
    MAP_Timer_A_startCounter(RX_CAP_ROL_TMR, TIMER_A_CONTINUOUS_MODE);

    /* enable interrupt - CCR0 is on TA0 interrupt while other CCRs on TA3 are on TA3N interrupt */
    MAP_Interrupt_enableInterrupt(RX_CAP_THR_TMR_INT);
    MAP_Interrupt_enableInterrupt(RX_CAP_ROL_TMR_INT);
}

/*------------------------------------------------------------------------------
* Timer TA0.1, TA0.2, TA0.3, TA0.4: PWM for quad motors
* TA0.0 is in UP mode.
* ------------------------------------------------------------------------------*/
static void timer_pwm_init()
{
    /* Configuring GPIO2.4i,5,6,7 as peripheral output for PWM  */
    MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(PWM_PORT, GPIO_PIN4,
            GPIO_PRIMARY_MODULE_FUNCTION);
    MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(PWM_PORT, GPIO_PIN5,
            GPIO_PRIMARY_MODULE_FUNCTION);
    MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(PWM_PORT, GPIO_PIN6,
            GPIO_PRIMARY_MODULE_FUNCTION);
    MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(PWM_PORT, GPIO_PIN7,
            GPIO_PRIMARY_MODULE_FUNCTION);

    NVIC->ISER[0] = 1 << ((TA0_0_IRQn) & 31);

    /* Configure TimerA0 without using Driverlib */
    TA0CCTL0 &= ~CCIFG;
    TA0CCTL0 = OUTMOD_7 | CCIE;                          // TACCR0 interrupt enabled
    TA0CCR0 = TMR_A_PERIOD;                   // PWM Period

    TA0CTL = TASSEL__SMCLK |                  // SMCLK
             MC__UP |                         // up mode
             ID_3;                            // divided by 8


    TA0CCTL1 = OUTMOD_7;                      // CCR1 reset/set
    TA0CCR1 = 0;                              // CCR1 PWM duty cycle

    TA0CCTL2 = OUTMOD_7;                      // CCR2 reset/set
    TA0CCR2 = 0;                              // CCR2 PWM duty cycle

    TA0CCTL3 = OUTMOD_7;                      // CCR3 reset/set
    TA0CCR3 = 0;                              // CCR3 PWM duty cycle

    TA0CCTL4 = OUTMOD_7;                      // CCR4 reset/set
    TA0CCR4 = 0;                              // CCR4 PWM duty cycle

}

/*------------------------------------------------------------------------------
*
------------------------------------------------------------------------------*/
void timer_init()
{

    timer_capture_init();

    timer_pwm_init();

