thanhtranhd/simple-flight-controller/simple-flight-controller/hal_msp432.c
    MAP_SysTick_enableModule();
    MAP_SysTick_setPeriod(24000000);
    MAP_SysTick_enableInterrupt();
}


/*******************************************************************************
 * This is the TIMERA_3_0 interrupt vector service routine.
 *
 * the input signal looks like this:
 *
 *                +-----+                                     +----+
 *                |     |                                     |    |
 * ---------------+     +-------------------------------------+    +-------------
 *
 * we need to capture the length of the high pulse only - which should be 900-2300
 * The low end can vary
 *
 * So start the capture only when we see the rising edge and take the time stamps
 * between the rising and fallin.
 *
 * The interrupt happens for both rising and falling edges. So make sure we start
 * the timestamp keeping only when signal rises then falls
 *
 *
 ******************************************************************************/
void TA3_0_IRQ(void)
{
    static int32_t thr_temp=0, tidx=0;
    int32_t val=0, tmp=0;

    tmp = RX_CAP_THR_CAP;

    channel_captures[THR_CAP_IDX][tidx++] = tmp;
    if (tidx>=MAX_CAPTURES_HISTORY) tidx=0;

    /* find out if we get here because of the raising or falling edge */
    if ((RX_CAP_THR_CCTL & TIMER_A_CCTLN_CCI) == 0)
    {
        /* we are in low level now  - must have gotten here by the falling edge */
        if (thr_temp == 0)
        {
            /* we started the capture at wrong phase - skip this capture */
            goto capture_end;
        }
    }

    if (thr_temp == 0)
    {
        thr_temp = tmp;
    }
    else
    {
        val = tmp  - thr_temp;

        if (val<0)
        {
            /*
             * case of when second capture has smaller value than previous capture
             * timer rolls over (16 bit), which happens very often       *
            */
            val = val + 0xffff;
        }

        TAKE_VALID_THR_CAPTURE(val, thr_pulse);

        thr_temp = 0;
    }

capture_end:

    RX_CAP_THR_CCTL &= ~(TIMER_A_CCTLN_COV); /* clear capture overflow if it happens */

    RX_CAP_THR_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */

}

/*******************************************************************************
 * This is the TIMERA_3_n interrupt vector service routine.
 * the input signal looks like this:
 *
 *                +-----+                                     +----+
 *                |     |                                     |    |
 * ---------------+     +-------------------------------------+    +-------------
 *
 * we need to capture the length of the high pulse only - which should be 900-2300
 * The low end can vary
 *
 * So start the capture only when we see the rising edge and take the time stamps
 * between the rising and fallin.
 *
 * The interrupt happens for both rising and falling edges. So make sure we start
 * the timestamp keeping only when signal rises then falls
 *
 */
//******************************************************************************/
void TA3_N_IRQ(void)
{
    static int32_t roll_temp=0, pitch_temp=0, rudder_temp=0, gyr_temp=0;
    static uint8_t  aidx = 0, eidx=0, ridx=0, gidx=0;
    int32_t val=0, atmp, ptmp, rtmp, gtmp;

    switch (RX_CAP_ROL_TAIV)
    {
        case RX_CAP_ROL_CCIFG:

            atmp = RX_CAP_ROL_CAP;

            channel_captures[AIL_CAP_IDX][aidx++] = atmp;
            if (aidx>=MAX_CAPTURES_HISTORY) aidx=0;

            if ((RX_CAP_ROL_CCTL & TIMER_A_CCTLN_CCI) == 0)
            {
                /* we are in low level now  - got here by the falling edge */
                if (roll_temp  == 0)
                {
                    /* we started the capture at wrong phase - skip this capture */

                    RX_CAP_ROL_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */
                    break;
                }
            }

            if (roll_temp == 0)
            {
                roll_temp = atmp;
            }
            else
            {
                val = atmp - roll_temp;
                if (val<0) val+=0xffff;

                roll_temp = 0;

                /* don't take the captures when timer overflows */
                TAKE_VALID_CAPTURE(val, ail_pulse);
            }

            RX_CAP_ROL_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */

            break;

        case RX_CAP_PIT_CCIFG:

            ptmp = RX_CAP_PIT_CAP;

            channel_captures[ELV_CAP_IDX][eidx++] = ptmp;
            if (eidx>=MAX_CAPTURES_HISTORY) eidx=0;

            if ((RX_CAP_PIT_CCTL & TIMER_A_CCTLN_CCI) == 0)
            {
                /* we are in low level now  - got here by the falling edge */
                if (pitch_temp  == 0)
                {
                    /* we started the capture at wrong phase - skip this capture */

                    RX_CAP_PIT_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */
                    break;
                }
            }

            if (pitch_temp == 0)
            {
                pitch_temp = ptmp;
            }
            else
            {
                val = ptmp - pitch_temp;

                if (val<0) val+=0xffff;

                /* take valid values only - timer seems to glitch from time to time */
                TAKE_VALID_CAPTURE(val, pit_pulse);

                pitch_temp = 0;
            }

            RX_CAP_PIT_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */

            break;

        case RX_CAP_RUD_CCIFG:

            rtmp = RX_CAP_RUD_CAP;

            channel_captures[RUD_CAP_IDX][ridx++] = rtmp;
            if (ridx>=MAX_CAPTURES_HISTORY) ridx=0;

            if ((RX_CAP_RUD_CCTL & TIMER_A_CCTLN_CCI) == 0)
            {
                /* we are in low level now  - got here by the falling edge */
                if (rudder_temp  == 0)
                {
                    /* we started the capture at wrong phase - skip this capture */

                    RX_CAP_RUD_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */
                    break;
                }
            }

            if (rudder_temp == 0)
            {
                rudder_temp = rtmp;
            }
            else
            {
                val = rtmp - rudder_temp;
                if (val<0) val+=0xffff;

                /* don't take the captures when timer overflows */
                TAKE_VALID_CAPTURE(val, rud_pulse);

