thanhtranhd/simple-flight-controller/simple-flight-controller/hal_msp432.c
                rudder_temp = 0;
            }

            RX_CAP_RUD_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */

            /* clear overflow flag if any */
            RX_CAP_RUD_CCTL &= ~(TIMER_A_CCTLN_COV);

            break;

        case RX_CAP_GYR_CCIFG:
            gtmp = RX_CAP_GYR_CAP;

            channel_captures[GYR_CAP_IDX][gidx++] = gtmp;
            if (gidx>=MAX_CAPTURES_HISTORY) gidx=0;

            if ((RX_CAP_GYR_CCTL & TIMER_A_CCTLN_CCI) == 0)
            {
                /* we are in low level now  - got here by the falling edge */
                if (gyr_temp  == 0)
                {
                    /* we started the capture at wrong phase - skip this capture */

                    RX_CAP_GYR_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */
                    break;
                }
            }

            if (gyr_temp == 0)
            {
                gyr_temp = gtmp;
            }
            else
            {
                val = gtmp - gyr_temp;
                if (val<0) val+=0xffff;

                gyr_temp = 0;

                /* don't take the captures when timer overflows */
                TAKE_VALID_CAPTURE(val, tx_gain_pulse);
            }

            RX_CAP_GYR_CCTL &= ~(TIMER_A_CCTLN_CCIFG); /* clear interrupt flag */

            break;

        default:
            /* either no interrupt or timer overflow. */
            //xor_green_led();
            break;
    }
}


void TA2_N_IRQHandler(void)
{
}

/*------------------------------------------------------------------------------
* update PWM
*
* 4 Motors are on TA0.1, TA0.2, TA0.3, TA0.4
------------------------------------------------------------------------------*/
void update_pwm()
{
   if (!(mixer_flags & MIXER_DISC_INPUT_ON)) 
   {
      mix_mixing_quad  ((INT16)ail_pulse, (INT16)pit_pulse, 
                        (INT16)thr_pulse, (INT16)rud_pulse, 
                        (INT16*)&front_motor,  (INT16*)&back_motor,  
                        (INT16*)&left_motor,  (INT16*)&right_motor);
   
      TA0CCR1 = front_motor;
      TA0CCR2 = back_motor;
      
      TA0CCR3 = left_motor;
      TA0CCR4 = right_motor;
   }
   else
   {
      TA0CCR1 = 0;
      TA0CCR2 = 0;
      
      TA0CCR3 = 0;
      TA0CCR4 = 0;
   }
}

/*------------------------------------------------------------------------------
*
------------------------------------------------------------------------------*/
void mcu_init()
{
   /* Halting WDT and disabling master interrupts */
   MAP_WDT_A_holdTimer();
   MAP_Interrupt_disableMaster();

    // Configure clocks

    startCrystalOscillator();
    setSystemClock(48000000);

#if 0
   #if 0
   /* Initialize main clock to 3MHz */
   MAP_CS_setDCOCenteredFrequency(CS_DCO_FREQUENCY_3);
   MAP_CS_initClockSignal(CS_MCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1 );
   MAP_CS_initClockSignal(CS_HSMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1 );
   MAP_CS_initClockSignal(CS_SMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1 );

   #elif 0

   /* Setting DCO to 24MHz (upping Vcore) */
   FlashCtl_setWaitState(FLASH_BANK0, 2);
   FlashCtl_setWaitState(FLASH_BANK1, 2);
   MAP_PCM_setCoreVoltageLevel(PCM_VCORE1);
   CS_setDCOCenteredFrequency(CS_DCO_FREQUENCY_24);

   MAP_CS_initClockSignal(CS_MCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1 );
   MAP_CS_initClockSignal(CS_SMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1 );

   #else

   /* Configuring pins for peripheral/crystal usage - 48MHz */
   MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_PJ,
                       GPIO_PIN3 | GPIO_PIN4, GPIO_PRIMARY_MODULE_FUNCTION);

   /* Setting the external clock frequency. This API is optional, but will
   * come in handy if the user ever wants to use the getMCLK/getACLK/etc
   * functions
   */
   CS_setExternalClockSourceFrequency(32000, 48000000);

   /* Starting HFXT in non-bypass mode without a timeout. Before we start
   * we have to change VCORE to 1 to support the 48MHz frequency */
   MAP_PCM_setCoreVoltageLevel(PCM_VCORE1);
   MAP_FlashCtl_setWaitState(FLASH_BANK0, 2);
   MAP_FlashCtl_setWaitState(FLASH_BANK1, 2);

   CS_startHFXT(false);

   /* Initializing MCLK to HFXT (effectively 48MHz) */
   /* using xtal for accurate timing for reading receiver signal */
   MAP_CS_initClockSignal(CS_MCLK, CS_HFXTCLK_SELECT, CS_CLOCK_DIVIDER_1);
   MAP_CS_initClockSignal(CS_SMCLK, CS_HFXTCLK_SELECT, CS_CLOCK_DIVIDER_2);
   
#endif
#endif

   // Configure ports -- switch inputs, LEDs, 
   configure_mcu_pins();

   timer_init();
   UART_init();

   ADC_init();   



   //start_adc(ADC_ROLL_INCH);
   MAP_Interrupt_enableSleepOnIsrExit();
   MAP_Interrupt_enableMaster();


   __enable_interrupt();  
}

/*------------------------------------------------------------------------------
* Timer A0 interrupt service routine
* Timer A0 ticks every TIMER_A period as defined in hal.h. 
------------------------------------------------------------------------------*/
void TA0_0_IRQHandler(void)
{
   xor_led1_led();

   if (!ms_100_timer)
   {
      ms_100_timer = TICKS_PER_100_MS;
      ms100_ticks++;
   }
   ms_100_timer--;

   if (!ms_10_timer)
   {
      ms_10_timer = TICKS_PER_10_MS;
   }
   ms_10_timer--;

   if (!pwm_rate_ticks)
   {
      pwm_rate_ticks = PWM_UPDATE_FREQ;
#ifdef USE_BRUSHED_ESC
      woken_up_by |= WOKEN_UP_BY_TIMER;
      __bic_SR_register_on_exit(LOW_POWER_MODE);   // wake CPU
#endif
   }
   pwm_rate_ticks--;

#ifndef USE_BRUSHED_ESC
   // wake up every timer ticks if we are not doing high speed PWM
   // as in brushed ESC case.
   woken_up_by |= WOKEN_UP_BY_TIMER;
   //__bic_SR_register_on_exit(LOW_POWER_MODE);   // wake CPU
#endif

   TA0CCTL0 &= ~CCIFG;
}


/*------------------------------------------------------------------------------
* PORT1 pin change ISR
------------------------------------------------------------------------------*/
void PORT1_IRQHandler(void)
{
}


/*------------------------------------------------------------------------------
// PORT 2 ISR 
------------------------------------------------------------------------------*/
void PORT2_IRQHandler(void)
{

#ifdef USE_CC2500   
#warn "!!! code built for built-in RX - using CC2500!!!"
   if (P2IFG & CC2500_GDO0)
   {
      // Fetch packet from CCxxxx & check the CRC==0x80 (OK)
      if (0x80 == RFReceivePacket(cc2500_rx_buffer, &cc2500_rx_buffer_len) &&
          (cc2500_rx_buffer_len == 11)) // TX module sent 10 bytes for 5 PWM values plus 1 byte address.   
      {
         // the following channels assignment is Spektrum / JR style 
         // which has the first channel in the PPM stream being the throttle
         // where as Futaba & Hitec use first channel as aileron.        
         thr_pulse = (cc2500_rx_buffer[1] << 8) | cc2500_rx_buffer[2];
         ail_pulse = (cc2500_rx_buffer[3] << 8) | cc2500_rx_buffer[4];
         pit_pulse = (cc2500_rx_buffer[5] << 8) | cc2500_rx_buffer[6];
         rud_pulse = (cc2500_rx_buffer[7] << 8) | cc2500_rx_buffer[8];
         tx_gain_pulse = (cc2500_rx_buffer[9] << 8) | cc2500_rx_buffer[10];
                 
