thanhtranhd/simple-flight-controller/simple-flight-controller/hal_msp432.c
         //woken_up_by |= WOKEN_UP_BY_WIRELESS;
         //__bic_SR_register_on_exit(LOW_POWER_MODE);   // wake CPU
      }
      P2IFG &= ~(CC2500_GDO0);               //Clr flag that caused int      
   }   
#endif   
}


/*------------------------------------------------------------------------------
* send a string to UART ....
------------------------------------------------------------------------------*/
void tx_string( char* string, int length )
{
  int pointer;
  char c;

  for( pointer = 0; pointer < length; pointer++)
  {
    c = string[pointer];
    MAP_UART_transmitData(EUSCI_A0_BASE, c);
  }
}

/*------------------------------------------------------------------------------
* send a char to UART ....
------------------------------------------------------------------------------*/
void tx_char( char digit)
{
    MAP_UART_transmitData(EUSCI_A0_BASE, digit);

}


/*------------------------------------------------------------------------------
* USCIA interrupt service routine
* UART receiving a character.
------------------------------------------------------------------------------*/
/* EUSCI A0 UART ISR */
void EUSCIA0_IRQHandler(void)
{
   uint32_t status = MAP_UART_getEnabledInterruptStatus(EUSCI_A0_BASE);
   char rx = ' ';

   MAP_UART_clearInterruptFlag(EUSCI_A0_BASE, status);

   if(status & EUSCI_A_UART_RECEIVE_INTERRUPT)
   {

      rx = MAP_UART_receiveData(EUSCI_A0_BASE); //UCA0RXBUF
   
      if (cmdLen < CMD_MAX_LEN)
      {
         cmdBuffer[cmdLen++] = rx;
      }
      else
      {
         cmdBuffer[cmdLen] = 0;
      }
  

      if (rx == ENTER_KEY_CODE)
      {
          if ((cmdLen <= 1) && (last_cmd_len > 0))
          {
              cmdLen = last_cmd_len;
              memcpy(cmdBuffer, last_cmd_buff, last_cmd_len);
              tx_string(cmdBuffer, cmdLen);
          }
          else
          {
              cmdBuffer[cmdLen-1] = 0;
              woken_up_by |= WOKEN_UP_BY_CMD;
          }
         //wake_mcu();
         //__bic_SR_register_on_exit(LOW_POWER_MODE);
      }

      tx_string(&rx,1); // might need to bring this print out of the interrupt!
   }
}


/*------------------------------------------------------------------------------
* ADC14 interrupt service routine
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
* ADC init
------------------------------------------------------------------------------*/
void ADC_init()
{
}

/*------------------------------------------------------------------------------
// start ADC
------------------------------------------------------------------------------*/
void start_adc(UINT16 adc_channel)
{
   
//   _BIS_SR(GIE);                              // enable interrupts   
}



/*------------------------------------------------------------------------------
// Write value to flash. Copied from MSP430F22xx examples
------------------------------------------------------------------------------*/

void write_flash(UINT16 address, INT8* buffer, INT8 length)
{
   int i = 0;
   char *Flash_ptr = 0;                         // Flash pointer
   
   Flash_ptr = (char*)address;
   
}



void SysTick_Handler()
{
    /* flashing RED LED on GPIO0 */
    //MAP_GPIO_toggleOutputOnPin(LED1_GPIO_PORT, LED1_LED);
    off_blue_led();
    off_red_led();
}

void TA2_0_IRQ(void)
{
    MAP_GPIO_toggleOutputOnPin(LED_GPIO_PORT, GREEN_LED);
}
#endif
